In [1]:
import pandas as pd
import time
import pickle
import datetime
from sqlalchemy import create_engine

from sqlalchemy_utils import database_exists, create_database
import psycopg2
import pandas as pd
import csv
import matplotlib.pyplot as plt

In [24]:
cluster_coords = pd.read_csv('cluster_coords.csv', index_col=0)
cluster_coords = cluster_coords.reset_index()

def convertRawClusterToClusterDict(rawCluster):
    clusterDict = {'lat': rawCluster[0], 'lon': rawCluster[1]}

In [44]:
def get_lat_ne_point_i(coords,i):
    val = coords.loc[coords['id']==i]['lat'].iloc[0]+.5
    return val

def get_lon_ne_point_i(coords,i):
    val = coords.loc[coords['id']==i]['lon'].iloc[0]+.5
    return val

def get_lat_sw_point_i(coords,i):
    val = coords.loc[coords['id']==i]['lat'].iloc[0]-.5
    return val

def get_lon_sw_point_i(coords,i):
    val = coords.loc[coords['id']==i]['lon'].iloc[0]-.5
    return val

In [31]:
cluster_coords.iloc[0]

lat    37.358594
lon   -88.919156
id      1.000000
Name: 0, dtype: float64

In [35]:
cluster_coords.loc[cluster_coords['id']==1]['lat'].iloc[0]

37.358594000000004

In [45]:
get_lat_ne_point_i(cluster_coords,1)

37.858594000000004

In [54]:
def convert_raw_vals_to_coord(lat,lon):
    clusterDict = {'lat': lat, 'lon': lon}
    return clusterDict

def get_ne_point_i(coords,i):
    lat=get_lat_ne_point_i(coords,i)
    lon=get_lon_ne_point_i(coords,i)
    val = convert_raw_vals_to_coord(lat,lon)    
    return val

def get_sw_point_i(coords,i):
    lat=get_lat_sw_point_i(coords,i)
    lon=get_lon_sw_point_i(coords,i)    
    val = convert_raw_vals_to_coord(lat,lon)
    return val

In [55]:
get_ne_point_i(cluster_coords,1)

{'lat': 37.858594000000004, 'lon': -88.419156}

In [57]:
def convert_points_to_window(ne_point,sw_point):
    window = {'ne': ne_point, 'sw': sw_point}
    return window

In [58]:
def get_corners_cluster_i(coords,i):
    ne_point = get_ne_point_i(coords,i)
    sw_point = get_sw_point_i(coords,i)
    val = convert_points_to_window(ne_point,sw_point)
    return val

In [62]:
get_corners_cluster_i(cluster_coords,2)

{'ne': {'lat': 42.30800418, 'lon': -87.08900703},
 'sw': {'lat': 41.30800418, 'lon': -88.08900703}}

In [87]:
def get_cluster_windows(coords):
    val = []
    for i in range(len(cluster_coords)):
        #print(i)
        window = get_corners_cluster_i(cluster_coords,i+1)
        val.append(window)
    return val

In [81]:
cluster_coords

          lat        lon  id
0   37.358594 -88.919156   1
1   41.808004 -87.589007   2
2   39.453278 -87.415510   3
3   39.441078 -88.162736   4
4   42.292710 -85.148531   5
5   39.471202 -88.193691   6
6   40.979808 -81.304734   7
7   41.101288 -83.179223   8
8   38.724824 -83.178550   9
9   39.581733 -82.014611  10
10  40.699795 -82.537020  11
11  40.372918 -82.396714  12
12  39.129814 -84.500237  13
13  38.964230 -77.327807  14
14  41.326537 -81.438560  15
15  38.770954 -77.270389  16
16  38.948630 -77.330033  17
17  37.755918 -83.914926  18
18  36.665279 -84.494194  19
19  39.588385 -79.986480  20
20  38.781433 -76.710027  21
21  39.098242 -76.728684  22
22  39.090782 -77.123466  23
23  39.126571 -76.878131  24
24  39.017167 -76.799520  25
25  35.794505 -78.689528  26
26  35.528072 -82.356854  27
27  35.882772 -78.987160  28
28  35.805704 -79.070797  29
29  35.813333 -81.167222  30
30  34.884163 -82.280235  31
31  33.262103 -87.514992  32
32  33.422391 -86.767825  33
33  34.419152 -85.616389  34
34  34.223327 -86.161357  35
35  32.011066 -85.442153  36
36  32.788461 -86.871655  37
37  33.458236 -85.576515  38

In [82]:
get_corners_cluster_i(cluster_coords,38)

{'ne': {'lat': 33.9582361919, 'lon': -85.0765152047},
 'sw': {'lat': 32.9582361919, 'lon': -86.0765152047}}

In [93]:
coord_windows=get_cluster_windows(cluster_coords)
get_cluster_windows(cluster_coords)[4]

{'ne': {'lat': 42.7927100677, 'lon': -84.648530556},
 'sw': {'lat': 41.7927100677, 'lon': -85.648530556}}

In [147]:
len(coord_windows)
windowtest = get_cluster_windows(cluster_coords)[4]
windowtest['ne']['lat']

42.7927100677

In [551]:
def get_butterfly_query_for_window(window):
    ne_point_lat = window['ne']['lat']
    sw_point_lat = window['sw']['lat']
    ne_point_lon = window['ne']['lon']
    sw_point_lon = window['sw']['lon']
    strg1 = "select observed_on, count(*) from wildlife_observations where iconic_taxon_name = {}"
    strg1 = strg1.format("'Insecta'")
    strg2 = " and latitude < {} and latitude > {}"
    strg2 = strg2.format(ne_point_lat,sw_point_lat)
    strg3 = " and longitude < {} and longitude > {} "
    strg3 = strg3.format(ne_point_lon,sw_point_lon)
    strg4 = " and observed_on > '2018-06-30' and observed_on < '2019-09-01' group by observed_on order by observed_on"
    
    strgreturn = strg1 + strg2 + strg3 + strg4
    
    #stringtest = "select count(*) from wildlife_observations where iconic_taxon_name = {} and latitude < {}
    #and latitude > {} and longitude < {} and longitude > {} and longitude < {}
    #and observed_on > '2010-01-01' group by observed_on order by observed_on"

    return strgreturn
#sql_timecount

def get_dragonfly_query_for_window(window):
    ne_point_lat = window['ne']['lat']
    sw_point_lat = window['sw']['lat']
    ne_point_lon = window['ne']['lon']
    sw_point_lon = window['sw']['lon']
    
    bstrg1 = "select observed_on, count(*) from wildlife_observations where iconic_taxon_name = {}"
    bstrg1 = bstrg1.format("'47792'")
    bstrg2 = " and latitude < {} and latitude > {}"
    bstrg2 = bstrg2.format(ne_point_lat,sw_point_lat)
    bstrg3 = " and longitude < {} and longitude > {} "
    bstrg3 = bstrg3.format(ne_point_lon,sw_point_lon)
    bstrg4 = " and observed_on > '2018-06-30' and observed_on < '2019-09-01' group by observed_on order by observed_on"
    
    bstrgreturn = bstrg1 + bstrg2 + bstrg3 + bstrg4
        
    
    #stringtest = "select count(*) from wildlife_observations where iconic_taxon_name = {} and latitude < {}
    #and latitude > {} and longitude < {} and longitude > {} and longitude < {}
    #and observed_on > '2010-01-01' group by observed_on order by observed_on"

    return bstrgreturn

In [531]:
get_dragonfly_query_for_window(windowtest)

"select observed_on, count(*) from wildlife_observations where iconic_taxon_name = '47792' and latitude < 42.7927100677 and latitude > 41.7927100677 and longitude < -84.648530556 and longitude > -85.648530556  and observed_on > '2018-06-30' and observed_on < '2019-09-01' group by observed_on order by observed_on"

In [201]:
username = 'postgres'
password = 'my_password_Sep3insight'
host = 'localhost'
port = '5432'
db_name = 'wildlife_observations'
engine = create_engine( 'postgresql://{}:{}@{}:{}/{}'.format(username, password, host, port, db_name) )
print(engine.url)

if not database_exists(engine.url):
    create_database(engine.url)
print(database_exists(engine.url))

postgresql://postgres:my_password_Sep3insight@localhost:5432/wildlife_observations
True

In [202]:
#butterflies.to_sql('wildlife_observations', engine, if_exists='append')
con = None
con = psycopg2.connect(database = db_name, user = username)

In [208]:
butterfly_cluster4_query = get_butterfly_query_for_window(windowtest) 
butterfly_cluster4 = pd.read_sql_query(butterfly_cluster4_query,con)

AttributeError: 'str' object has no attribute 'head'

In [210]:
butterfly_cluster4

    observed_on  count
0    2010-07-13      1
1    2010-07-14      1
2    2010-07-20      1
3    2010-08-04      1
4    2010-10-03      1
..          ...    ...
567  2019-09-14     17
568  2019-09-15      7
569  2019-09-16      6
570  2019-09-17      6
571  2019-09-18     11

[572 rows x 2 columns]

In [396]:
def convert_format_cluster(butterfly,dragonfly):
    formatDict = {'butterfly': butterfly, 'dragonfly': dragonfly}
    return formatDict

def get_data_from_sql(query):
    val = pd.read_sql_query(query,con)
    return val
    
def rebin_data_monthly(test):
    test.index = pd.to_datetime(test['observed_on']) 
    test = test.groupby(pd.Grouper(freq='M')).sum()    
    test = test.reset_index()
    test.columns = ['ds','monthly_count']   
    return test
#probably could drop that return because it is modifying in place
    

def group_by_cluster_i(coords,i):
    cluster_id = i+1
    #get_cluster_windows(cluster_coords)[4]   outputs the below 
    #{'ne': {'lat': 42.7927100677, 'lon': -84.648530556},
    # 'sw': {'lat': 41.7927100677, 'lon': -85.648530556}}
    window = get_cluster_windows(coords)[i]
    dragon_query = get_dragonfly_query_for_window(window)
    butter_query = get_butterfly_query_for_window(window)
    organized_query = convert_format_cluster(butter_query, dragon_query)
    #organized_data = convert_format_cluster(2,3)
    
    dragon_data = get_data_from_sql(dragon_query)
    butter_data = get_data_from_sql(butter_query)
    organized_data = convert_format_cluster(rebin_data_monthly(butter_data), rebin_data_monthly(dragon_data))
    
    return_dict = {'query': organized_query, 'data': organized_data, 'cluster_id': i}
    return return_dict

In [365]:
test_query = group_by_cluster_i(cluster_coords,4)

In [325]:
test_query['query']['butterfly']

"select observed_on, count(*) from wildlife_observations where iconic_taxon_name = 'Insecta' and latitude < 42.7927100677 and latitude > 41.7927100677 and longitude < -84.648530556 and longitude > -85.648530556  and observed_on > '2010-01-01' group by observed_on order by observed_on"

In [329]:
test_query['data']['butterfly']

    observed_on  count
0    2010-07-13      1
1    2010-07-14      1
2    2010-07-20      1
3    2010-08-04      1
4    2010-10-03      1
..          ...    ...
567  2019-09-14     17
568  2019-09-15      7
569  2019-09-16      6
570  2019-09-17      6
571  2019-09-18     11

[572 rows x 2 columns]

In [330]:
test_query['data']['dragonfly']

    observed_on  count
0    2010-07-13      1
1    2010-07-14      5
2    2010-07-21      1
3    2012-07-28      1
4    2013-05-31      1
..          ...    ...
237  2019-09-02      2
238  2019-09-05      1
239  2019-09-07      1
240  2019-09-12      1
241  2019-09-14      1

[242 rows x 2 columns]

In [362]:
#def rebin_data_monthly(data):
#    val = data
#    val.index = pd.to_datetime(val['observed_on']) 
#    val = val.groupby(pd.Grouper(freq='M')).sum()    
#    val = val.reset_index()
#    val.columns = ['ds','monthly_count']    
#    return val
#above doesn't work but below does val = data does not maintain type somehow

def rebin_data_monthly(test):
    test.index = pd.to_datetime(test['observed_on']) 
    test = test.groupby(pd.Grouper(freq='M')).sum()    
    test = test.reset_index()
    test.columns = ['ds','monthly_count']   
    return test

In [347]:
test = test_query['data']['dragonfly']

In [360]:
def testthisthing(test):
    test.index = pd.to_datetime(test['observed_on']) 
    test = test.groupby(pd.Grouper(freq='M')).sum()    
    test = test.reset_index()
    test.columns = ['ds','monthly_count']   
    return test

In [363]:
rebin_data_monthly(test_query['data']['dragonfly'])

            ds  monthly_count
0   2010-07-31              7
1   2010-08-31              0
2   2010-09-30              0
3   2010-10-31              0
4   2010-11-30              0
..         ...            ...
106 2019-05-31              5
107 2019-06-30            126
108 2019-07-31             77
109 2019-08-31             40
110 2019-09-30              7

[111 rows x 2 columns]

In [358]:
test

            ds  monthly_count
0   2010-07-31              7
1   2010-08-31              0
2   2010-09-30              0
3   2010-10-31              0
4   2010-11-30              0
..         ...            ...
106 2019-05-31              5
107 2019-06-30            126
108 2019-07-31             77
109 2019-08-31             40
110 2019-09-30              7

[111 rows x 2 columns]

In [343]:
test = test.reset_index()
test.columns = ['ds','monthly_count']

In [344]:
test

            ds  val
0   2010-07-31    7
1   2010-08-31    0
2   2010-09-30    0
3   2010-10-31    0
4   2010-11-30    0
..         ...  ...
106 2019-05-31    5
107 2019-06-30  126
108 2019-07-31   77
109 2019-08-31   40
110 2019-09-30    7

[111 rows x 2 columns]

In [367]:
test_query['cluster_id']

4

In [397]:
def get_cluster_data(coords):
    val = []
    for i in range(len(coords)):
    #for i in range(2):
        cluster_data = group_by_cluster_i(coords,i)  
        val.append(cluster_data)
    return val

In [369]:
len(cluster_coords)

38

In [552]:
test = get_cluster_data(cluster_coords)

In [399]:
len(test)

38

In [547]:
test[31]['data']['dragonfly']

           ds  monthly_count
0  2018-07-31             22
1  2018-08-31              9
2  2018-09-30             12
3  2018-10-31              7
4  2018-11-30              1
5  2018-12-31              0
6  2019-01-31              0
7  2019-02-28              0
8  2019-03-31              4
9  2019-04-30             34
10 2019-05-31              9
11 2019-06-30             17
12 2019-07-31              6
13 2019-08-31              5

In [539]:
min(lambda x: len(test[x]['data']['dragonfly']))

TypeError: 'function' object is not iterable

In [554]:
output = open('cluster_monthly_observation_data_2018-07-31_2019-08-31.pk1','wb')
pickle.dump(test,output)
output.close()

In [464]:
len(test[31]['data']['dragonfly'])

42

In [470]:
test[31]['data']['dragonfly'].loc[0]['monthly_count']

6

In [471]:
type(test[31]['data']['dragonfly'].loc[0]['monthly_count'])

numpy.int64

In [546]:
test[4]['data']['dragonfly']

           ds  monthly_count
0  2018-07-31             62
1  2018-08-31             17
2  2018-09-30              5
3  2018-10-31              4
4  2018-11-30              0
5  2018-12-31              0
6  2019-01-31              0
7  2019-02-28              0
8  2019-03-31              0
9  2019-04-30              1
10 2019-05-31              5
11 2019-06-30            126
12 2019-07-31             77
13 2019-08-31             40

In [556]:
test[4]['data']['butterfly']

           ds  monthly_count
0  2018-07-31            577
1  2018-08-31            430
2  2018-09-30            155
3  2018-10-31             30
4  2018-11-30              4
5  2018-12-31              1
6  2019-01-31              1
7  2019-02-28              1
8  2019-03-31              3
9  2019-04-30             32
10 2019-05-31             61
11 2019-06-30            363
12 2019-07-31            942
13 2019-08-31            899

In [555]:
test[30]['data']['butterfly']

           ds  monthly_count
0  2018-07-31            159
1  2018-08-31            218
2  2018-09-30             96
3  2018-10-31             59
4  2018-11-30              8
5  2018-12-31              1
6  2019-01-31              3
7  2019-02-28              0
8  2019-03-31             10
9  2019-04-30             83
10 2019-05-31            200
11 2019-06-30            162
12 2019-07-31            634
13 2019-08-31           1410